<template>
  <v-list style="overflow-y: auto" max-height="300">
    <vidhyaarthi-abhyaas
      v-for="जानकारी in जानकारियाँ"
      :key="जानकारी.पहचान"
      :jankari="जानकारी"
    />
  </v-list>
</template>
<script setup lang="ts">
import VidhyaarthiAbhyaas from "./विद्यार्थी-अभ्यास.vue";
import type जानकारी_प्रकार from "../प्रकार.ts";

const जानकारियाँ: जानकारी_प्रकार[] = [
  {
    विद्यार्थी: "कुमार",
    शब्द: "भाषा",
    लिखा: "भाशा",
    समय: "१२:०१ १५/१२/२०२४",
    पहचान: "०००१",
  },
  {
    विद्यार्थी: "कुमार",
    शब्द: "भाषा",
    लिखा: "भासा",
    समय: "१२:०१ १५/१२/२०२४",
    पहचान: "०००२",
  },
  {
    विद्यार्थी: "कुमार",
    शब्द: "भाषा",
    लिखा: "भाषा",
    समय: "१२:०२ १५/१२/२०२४",
    पहचान: "०००३",
  },
  {
    विद्यार्थी: "दिव्या",
    शब्द: "भाषा",
    लिखा: "भाषा",
    समय: "१२:०० १५/१२/२०२४",
    पहचान: "०००४",
  },
  {
    विद्यार्थी: "दिव्या",
    शब्द: "पृष्ठ",
    लिखा: "पृष्ट",
    समय: "१२:०० १५/१२/२०२४",
    पहचान: "०००५",
  },
  {
    विद्यार्थी: "दिव्या",
    शब्द: "प्रुष्ट",
    लिखा: "भाषा",
    समय: "१२:०१ १५/१२/२०२४",
    पहचान: "०००६",
  },
  {
    विद्यार्थी: "दिव्या",
    शब्द: "पृष्ठ",
    लिखा: "पृष्ठ",
    समय: "१२:०१ १५/१२/२०२४",
    पहचान: "०००७",
  },
  {
    विद्यार्थी: "दिव्या",
    शब्द: "त्रुटि",
    लिखा: "तृटि",
    समय: "१४:१० १२/१२/२०२४",
    पहचान: "०००८",
  },
  {
    विद्यार्थी: "दिव्या",
    शब्द: "त्रिती",
    लिखा: "भाषा",
    समय: "१४:११ १२/१२/२०२४",
    पहचान: "०००९",
  },
  {
    विद्यार्थी: "दिव्या",
    शब्द: "त्रुटि",
    लिखा: "त्रृति",
    समय: "१४:११ १२/१२/२०२४",
    पहचान: "००१०",
  },
  {
    विद्यार्थी: "दिव्या",
    शब्द: "त्रुटि",
    लिखा: "त्रुठी",
    समय: "१४:११ १२/१२/२०२४",
    पहचान: "००११",
  },
  {
    विद्यार्थी: "दिव्या",
    शब्द: "त्रुटि",
    लिखा: "त्रुटि",
    समय: "१४:१४ १२/१२/२०२४",
    पहचान: "००१२",
  },
  {
    विद्यार्थी: "कुमार",
    शब्द: "वहाँ",
    लिखा: "बहाँ",
    समय: "१०:३४ १५/१२/२०२४",
    पहचान: "००१३",
  },
  {
    विद्यार्थी: "कुमार",
    शब्द: "वहाँ",
    लिखा: "वहाँ",
    समय: "१०:३५ १५/१२/२०२४",
    पहचान: "००२४",
  },
  {
    विद्यार्थी: "कृतिका",
    शब्द: "पालना",
    लिखा: "बालना",
    समय: "१४:११ १२/१२/२०२४",
    पहचान: "००१५",
  },
  {
    विद्यार्थी: "कृतिका",
    शब्द: "पालना",
    लिखा: "पालना",
    समय: "१४:११ १२/१२/२०२४",
    पहचान: "००१६",
  },
  {
    विद्यार्थी: "कृतिका",
    शब्द: "काम",
    लिखा: "कम",
    समय: "१४:१४ १२/१२/२०२४",
    पहचान: "००२७",
  },
  {
    विद्यार्थी: "कृतिका",
    शब्द: "काम",
    लिखा: "काम",
    समय: "१०:३४ १५/१२/२०२४",
    पहचान: "००१८",
  },
  {
    विद्यार्थी: "कुमार",
    शब्द: "काम",
    लिखा: "फाम",
    समय: "१०:३५ १५/१२/२०२४",
    पहचान: "००२९",
  },
  {
    विद्यार्थी: "कुमार",
    शब्द: "काम",
    लिखा: "काम",
    समय: "१०:३५ १५/१२/२०२४",
    पहचान: "००३०",
  },
];
</script>
