<template>
  <v-list style="overflow-y: auto" max-height="300">
    <gana
      v-for="जानकारी in जानकारियाँ"
      :key="जानकारी.पहचान"
      :jankari="जानकारी"
    />
  </v-list>
</template>
<script setup lang="ts">
import Gana from "./गाना.vue";
import type { जानकारी_प्रकार } from "../प्रकार.ts";

const जानकारियाँ: जानकारी_प्रकार[] = [
  {
    गायक: "कुमार",
    गाना: "गाना का नाम",
    तिथी: "१५/१२/२०२४",
    पहचान: "०००१",
  },
  {
    गायक: "कुमार",
    गाना: "गाना का नाम",
    तिथी: "१५/१२/२०२४",
    पहचान: "०००२",
  },
  {
    गायक: "कुमार",
    गाना: "गाना का नाम",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "०००३",
  },
  {
    गायक: "दिव्या",
    गाना: "गाना का नाम",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "०००४",
  },
  {
    गायक: "दिव्या",
    गाना: "गाना का नाम",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "०००५",
  },
  {
    गायक: "दिव्या",
    गाना: "गाना का नाम",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "०००६",
  },
  {
    गायक: "दिव्या",
    गाना: "गाना का नाम",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "०००७",
  },
  {
    गायक: "दिव्या",
    गाना: "गाना का नाम",
    
    तिथी: "१२/१२/२०२४",
    पहचान: "०००८",
  },
  {
    गायक: "दिव्या",
    गाना: "गाना का नाम",
    
    तिथी: "१२/१२/२०२४",
    पहचान: "०००९",
  },
  {
    गायक: "दिव्या",
    गाना: "गाना का नाम",
    
    तिथी: "१२/१२/२०२४",
    पहचान: "००१०",
  },
  {
    गायक: "दिव्या",
    गाना: "गाना का नाम",
    
    तिथी: "१२/१२/२०२४",
    पहचान: "००११",
  },
  {
    गायक: "दिव्या",
    गाना: "गाना का नाम",
    
    तिथी: "१२/१२/२०२४",
    पहचान: "००१२",
  },
  {
    गायक: "कुमार",
    गाना: "गाना का नाम",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "००१३",
  },
  {
    गायक: "कुमार",
    गाना: "गाना का नाम",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "००२४",
  },
  {
    गायक: "कृतिका",
    गाना: "गाना का नाम",
    
    तिथी: "१२/१२/२०२४",
    पहचान: "००१५",
  },
  {
    गायक: "कृतिका",
    गाना: "गाना का नाम",
    
    तिथी: "१२/१२/२०२४",
    पहचान: "००१६",
  },
  {
    गायक: "कृतिका",
    गाना: "गाना का नाम",
    
    तिथी: "१२/१२/२०२४",
    पहचान: "००२७",
  },
  {
    गायक: "कृतिका",
    गाना: "गाना का नाम",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "००१८",
  },
  {
    गायक: "कुमार",
    गाना: "गाना का नाम",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "००२९",
  },
  {
    गायक: "कुमार",
    गाना: "गाना का नाम",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "००३०",
  },
];
</script>
