<template>
  <v-list style="overflow-y: auto" max-height="300">
    <gana
      v-for="जानकारी in जानकारियाँ"
      :key="जानकारी.पहचान"
      :jankari="जानकारी"
    />
  </v-list>
</template>
<script setup lang="ts">
import Gana from "./गाना.vue";
import type { जानकारी_प्रकार } from "../प्रकार.ts";

const जानकारियाँ: जानकारी_प्रकार[] = [
  {
    गायक: "बॉम्बे जयश्री",
    गाना: "ममता से भरी",
    तिथी: "१५/१२/२०२४",
    पहचान: "०००१",
  },
  {
    गायक: "कैलाश खेर",
    गाना: "जल रहीं हैं",
    तिथी: "१५/१२/२०२४",
    पहचान: "०००२",
  },
  {
    गायक: "बॉम्बे जयश्री",
    गाना: "स्वप्न सुनहरा",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "०००३",
  },
  {
    गायक: "नीति मोहन",
    गाना: "खोया हैं",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "०००४",
  },
  {
    गायक: "कैलाश खेर",
    गाना: "कौन है वो",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "०००५",
  },
  {
    गायक: "एम एम कीरवानी",
    गाना: "पंछी बोले",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "०००६",
  },
  {
    गायक: "नीति मोहन",
    गाना: "मनोहारी",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "०००७",
  },
  {
    गायक: "कार्थिक",
    गाना: "पचा बोत्तासी",
    
    तिथी: "१२/१२/२०२४",
    पहचान: "०००८",
  },
  {
    गायक: "गीता माधुरी",
    गाना: "जीवा नधि",
    
    तिथी: "१२/१२/२०२४",
    पहचान: "०००९",
  },
  {
    गायक: "रम्या बेहरा",
    गाना: "धीवरा",
    
    तिथी: "१२/१२/२०२४",
    पहचान: "००१०",
  },
  {
    गायक: "सत्य यामिनी",
    गाना: "ममताला तल्ली",
    
    तिथी: "१२/१२/२०२४",
    पहचान: "००११",
  },
  {
    गायक: "एम एम कीरवानी",
    गाना: "निप्पुला स्वसा गा",
    
    तिथी: "१२/१२/२०२४",
    पहचान: "००१२",
  },
  {
    गायक: "मोहना भोगराजु",
    गाना: "मनोहारी",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "००१३",
  },
  {
    गायक: "एम एम कीरवानी",
    गाना: "सिवुनि आना",
    
    तिथी: "१५/१२/२०२४",
    पहचान: "००२४",
  }
];
</script>
